In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib as plt

## Pandas의 기본 목적
- 누락된 데이터를 유연하게 처리하는 기능
- 시계열 데이터와 비시계열 데이터를 함께 다룰 수 있는 기능
- 통합된 시계열 기능
- SQ처럼 관계연산을 가능하게 하는 기능

- Series는 일력의 객체를 담을 수 있는 1차원 배열같은 자료 구조

In [5]:
obj = Series([10,20,30,40])
obj

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
obj.values

array([10, 20, 30, 40], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 =Series([30,201,223,42],index=['a','b','c','d'])
obj2

a     30
b    201
c    223
d     42
dtype: int64

In [11]:
obj2[obj2>50]

b    201
c    223
dtype: int64

In [12]:
obj2*2

a     60
b    402
c    446
d     84
dtype: int64

In [13]:
sdata = {'Obiio':35000, 'Texas':1200,'Oregon':1500}

In [16]:

obj3 = Series(sdata)
obj3

Obiio     35000
Texas      1200
Oregon     1500
dtype: int64

In [17]:
states =['Texas','Oregon','Seoul']
obj4 = Series(sdata, index=states)
obj4

Texas     1200.0
Oregon    1500.0
Seoul        NaN
dtype: float64

In [18]:
obj4.index.name='Tokyo'
obj4

Tokyo
Texas     1200.0
Oregon    1500.0
Seoul        NaN
dtype: float64

In [34]:
#series 객체의 name 속성
obj4.name='sss'

In [35]:
obj4

Tokyo
Texas     1200.0
Oregon    1500.0
Seoul        NaN
Name: sss, dtype: float64

In [41]:
data = {'state':['Ohio','Nevada','NewYork'],
       'year':[2000,2020,1990],
       'pop':[12,32,45]}
frame =DataFrame(data)

In [42]:
frame

     state  year  pop
0     Ohio  2000   12
1   Nevada  2020   32
2  NewYork  1990   45

In [43]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [44]:
frame['state']

0       Ohio
1     Nevada
2    NewYork
Name: state, dtype: object

In [45]:
frame.year

0    2000
1    2020
2    1990
Name: year, dtype: int64

In [49]:
frame.loc[0]

state    Ohio
year     2000
pop        12
Name: 0, dtype: object

In [50]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [52]:
#색인 객체는 변경 불가능
#index[1]='d'

In [54]:
'state' in frame.columns

True

In [56]:
obj5= Series([1,2,3,4])

In [57]:
obj5

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['a','b','c','d'],columns=['one','two','three','four'])
data.drop(['a','b'])

   one  two  three  four
c    8    9     10    11
d   12   13     14    15

In [60]:
data.drop(['one','two'], axis=1)

   three  four
a      2     3
b      6     7
c     10    11
d     14    15

In [63]:
# DataFrame.drop은 index와 column 둘다 삭제 가능\

#index를 입력 , column을 입력
data.loc['a',['one','two']]

one    0
two    1
Name: a, dtype: int32

In [2]:
df1 = DataFrame(np.arange(9).reshape((3,3)), columns = list('bcd'), index=['ohio','texas','Oregon'])
df2 = DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), index=['Utah','ohio','texas','Oregon'])

In [68]:
df1+ df2

           b   c     d   e
Oregon  15.0 NaN  18.0 NaN
Utah     NaN NaN   NaN NaN
ohio     3.0 NaN   6.0 NaN
texas    9.0 NaN  12.0 NaN

In [69]:
df1

        b  c  d
ohio    0  1  2
texas   3  4  5
Oregon  6  7  8

In [70]:
df2

        b   d   e
Utah    0   1   2
ohio    3   4   5
texas   6   7   8
Oregon  9  10  11

In [71]:
df1.add(df2, fill_value=0)

           b    c     d     e
Oregon  15.0  7.0  18.0  11.0
Utah     0.0  NaN   1.0   2.0
ohio     3.0  1.0   6.0   5.0
texas    9.0  4.0  12.0   8.0

In [72]:
arr = np.arange(12).reshape((3,4))

In [73]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [74]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [17]:
f = lambda x: x.max()-x.min()

In [18]:
data.apply(f)

one      12
two      12
three    12
four     12
dtype: int64

In [9]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

data.apply(f)

     one  two  three  four
min    0    1      2     3
max   12   13     14    15

In [13]:
obj = Series(range(4), index=['d','a','b','c'])

In [15]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [19]:
data

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15